newwms_gift/src/InformationRegisters/итWMSSSCCпаллет/итWMSSSCCпаллет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSSSCCпаллет</name>
  <resources>
    <name>SSCC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>26</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторSSCC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>FSRAR_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифраРасширения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.итФилиалыWMS</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДиапазона</name>
    <type>
      <types>EnumRef.итWMSВидыДиапазонвSSCC</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЛогистическойЕденицыWMS</name>
    <type>
      <types>EnumRef.итWMSТипыЛогистическойЕденицыWMS</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/InformationRegisters/итWMSSSCCпаллет/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура Редактировать(Команда)
		Элементы.GS1.ТолькоПросмотр=Ложь;
		Элементы.SSCC.ТолькоПросмотр=Ложь;
		Элементы.ВидДиапазона.ТолькоПросмотр=Ложь;
		Элементы.ЦифраРасширения.ТолькоПросмотр=Ложь;
		Элементы.Филиал.ТолькоПросмотр=Ложь;
		Элементы.ИдентификаторSSCC.ТолькоПросмотр=Ложь;
КонецПроцедуры
